MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX270F256D.PIC
      <edc:DCRDef edc:_addr="0x1FC00BFC" edc:access="---n---n-----nnnnnnnnn-----nnnnn" edc:cname="DEVCFG0" edc:default="0x7fffffff" edc:desc="" edc:factorydefault="0x7fffffff" edc:impl="0x1107fc1f" edc:name="DEVCFG0" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x1107FC1F">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable" edc:isidehidden="true" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Debugger is Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Debugger is Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG Port Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="ICE/ICD Comm Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="Communicate on PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="Communicate on PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx3" edc:desc="Communicate on PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx4" edc:desc="Communicate on PGEC4/PGED4" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="PWP" edc:desc="Program Flash Write Protect" edc:mask="0x1ff" edc:name="PWP" edc:nzwidth="9">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable" edc:when="(field &amp; 0x1ff) == 0x1ff"/>
              <edc:DCRFieldSemantic edc:cname="PWP1K" edc:desc="First 1K" edc:when="(field &amp; 0x1ff) == 0x1fe"/>
              <edc:DCRFieldSemantic edc:cname="PWP2K" edc:desc="First 2K" edc:when="(field &amp; 0x1ff) == 0x1fd"/>
              <edc:DCRFieldSemantic edc:cname="PWP3K" edc:desc="First 3K" edc:when="(field &amp; 0x1ff) == 0x1fc"/>
              <edc:DCRFieldSemantic edc:cname="PWP4K" edc:desc="First 4K" edc:when="(field &amp; 0x1ff) == 0x1fb"/>
              <edc:DCRFieldSemantic edc:cname="PWP5K" edc:desc="First 5K" edc:when="(field &amp; 0x1ff) == 0x1fa"/>
              <edc:DCRFieldSemantic edc:cname="PWP6K" edc:desc="First 6K" edc:when="(field &amp; 0x1ff) == 0x1f9"/>
              <edc:DCRFieldSemantic edc:cname="PWP7K" edc:desc="First 7K" edc:when="(field &amp; 0x1ff) == 0x1f8"/>
              <edc:DCRFieldSemantic edc:cname="PWP8K" edc:desc="First 8K" edc:when="(field &amp; 0x1ff) == 0x1f7"/>
              <edc:DCRFieldSemantic edc:cname="PWP9K" edc:desc="First 9K" edc:when="(field &amp; 0x1ff) == 0x1f6"/>
              <edc:DCRFieldSemantic edc:cname="PWP10K" edc:desc="First 10K" edc:when="(field &amp; 0x1ff) == 0x1f5"/>
              <edc:DCRFieldSemantic edc:cname="PWP11K" edc:desc="First 11K" edc:when="(field &amp; 0x1ff) == 0x1f4"/>
              <edc:DCRFieldSemantic edc:cname="PWP12K" edc:desc="First 12K" edc:when="(field &amp; 0x1ff) == 0x1f3"/>
              <edc:DCRFieldSemantic edc:cname="PWP13K" edc:desc="First 13K" edc:when="(field &amp; 0x1ff) == 0x1f2"/>
              <edc:DCRFieldSemantic edc:cname="PWP14K" edc:desc="First 14K" edc:when="(field &amp; 0x1ff) == 0x1f1"/>
              <edc:DCRFieldSemantic edc:cname="PWP15K" edc:desc="First 15K" edc:when="(field &amp; 0x1ff) == 0x1f0"/>
              <edc:DCRFieldSemantic edc:cname="PWP16K" edc:desc="First 16K" edc:when="(field &amp; 0x1ff) == 0x1ef"/>
              <edc:DCRFieldSemantic edc:cname="PWP17K" edc:desc="First 17K" edc:when="(field &amp; 0x1ff) == 0x1ee"/>
              <edc:DCRFieldSemantic edc:cname="PWP18K" edc:desc="First 18K" edc:when="(field &amp; 0x1ff) == 0x1ed"/>
              <edc:DCRFieldSemantic edc:cname="PWP19K" edc:desc="First 19K" edc:when="(field &amp; 0x1ff) == 0x1ec"/>
              <edc:DCRFieldSemantic edc:cname="PWP20K" edc:desc="First 20K" edc:when="(field &amp; 0x1ff) == 0x1eb"/>
              <edc:DCRFieldSemantic edc:cname="PWP21K" edc:desc="First 21K" edc:when="(field &amp; 0x1ff) == 0x1ea"/>
              <edc:DCRFieldSemantic edc:cname="PWP22K" edc:desc="First 22K" edc:when="(field &amp; 0x1ff) == 0x1e9"/>
              <edc:DCRFieldSemantic edc:cname="PWP23K" edc:desc="First 23K" edc:when="(field &amp; 0x1ff) == 0x1e8"/>
              <edc:DCRFieldSemantic edc:cname="PWP24K" edc:desc="First 24K" edc:when="(field &amp; 0x1ff) == 0x1e7"/>
              <edc:DCRFieldSemantic edc:cname="PWP25K" edc:desc="First 25K" edc:when="(field &amp; 0x1ff) == 0x1e6"/>
              <edc:DCRFieldSemantic edc:cname="PWP26K" edc:desc="First 26K" edc:when="(field &amp; 0x1ff) == 0x1e5"/>
              <edc:DCRFieldSemantic edc:cname="PWP27K" edc:desc="First 27K" edc:when="(field &amp; 0x1ff) == 0x1e4"/>
              <edc:DCRFieldSemantic edc:cname="PWP28K" edc:desc="First 28K" edc:when="(field &amp; 0x1ff) == 0x1e3"/>
              <edc:DCRFieldSemantic edc:cname="PWP29K" edc:desc="First 29K" edc:when="(field &amp; 0x1ff) == 0x1e2"/>
              <edc:DCRFieldSemantic edc:cname="PWP30K" edc:desc="First 30K" edc:when="(field &amp; 0x1ff) == 0x1e1"/>
              <edc:DCRFieldSemantic edc:cname="PWP31K" edc:desc="First 31K" edc:when="(field &amp; 0x1ff) == 0x1e0"/>
              <edc:DCRFieldSemantic edc:cname="PWP32K" edc:desc="First 32K" edc:when="(field &amp; 0x1ff) == 0x1df"/>
              <edc:DCRFieldSemantic edc:cname="PWP33K" edc:desc="First 33K" edc:when="(field &amp; 0x1ff) == 0x1de"/>
              <edc:DCRFieldSemantic edc:cname="PWP34K" edc:desc="First 34K" edc:when="(field &amp; 0x1ff) == 0x1dd"/>
              <edc:DCRFieldSemantic edc:cname="PWP35K" edc:desc="First 35K" edc:when="(field &amp; 0x1ff) == 0x1dc"/>
              <edc:DCRFieldSemantic edc:cname="PWP36K" edc:desc="First 36K" edc:when="(field &amp; 0x1ff) == 0x1db"/>
              <edc:DCRFieldSemantic edc:cname="PWP37K" edc:desc="First 37K" edc:when="(field &amp; 0x1ff) == 0x1da"/>
              <edc:DCRFieldSemantic edc:cname="PWP38K" edc:desc="First 38K" edc:when="(field &amp; 0x1ff) == 0x1d9"/>
              <edc:DCRFieldSemantic edc:cname="PWP39K" edc:desc="First 39K" edc:when="(field &amp; 0x1ff) == 0x1d8"/>
              <edc:DCRFieldSemantic edc:cname="PWP40K" edc:desc="First 40K" edc:when="(field &amp; 0x1ff) == 0x1d7"/>
              <edc:DCRFieldSemantic edc:cname="PWP41K" edc:desc="First 41K" edc:when="(field &amp; 0x1ff) == 0x1d6"/>
              <edc:DCRFieldSemantic edc:cname="PWP42K" edc:desc="First 42K" edc:when="(field &amp; 0x1ff) == 0x1d5"/>
              <edc:DCRFieldSemantic edc:cname="PWP43K" edc:desc="First 43K" edc:when="(field &amp; 0x1ff) == 0x1d4"/>
              <edc:DCRFieldSemantic edc:cname="PWP44K" edc:desc="First 44K" edc:when="(field &amp; 0x1ff) == 0x1d3"/>
              <edc:DCRFieldSemantic edc:cname="PWP45K" edc:desc="First 45K" edc:when="(field &amp; 0x1ff) == 0x1d2"/>
              <edc:DCRFieldSemantic edc:cname="PWP46K" edc:desc="First 46K" edc:when="(field &amp; 0x1ff) == 0x1d1"/>
              <edc:DCRFieldSemantic edc:cname="PWP47K" edc:desc="First 47K" edc:when="(field &amp; 0x1ff) == 0x1d0"/>
              <edc:DCRFieldSemantic edc:cname="PWP48K" edc:desc="First 48K" edc:when="(field &amp; 0x1ff) == 0x1cf"/>
              <edc:DCRFieldSemantic edc:cname="PWP49K" edc:desc="First 49K" edc:when="(field &amp; 0x1ff) == 0x1ce"/>
              <edc:DCRFieldSemantic edc:cname="PWP50K" edc:desc="First 50K" edc:when="(field &amp; 0x1ff) == 0x1cd"/>
              <edc:DCRFieldSemantic edc:cname="PWP51K" edc:desc="First 51K" edc:when="(field &amp; 0x1ff) == 0x1cc"/>
              <edc:DCRFieldSemantic edc:cname="PWP52K" edc:desc="First 52K" edc:when="(field &amp; 0x1ff) == 0x1cb"/>
              <edc:DCRFieldSemantic edc:cname="PWP53K" edc:desc="First 53K" edc:when="(field &amp; 0x1ff) == 0x1ca"/>
              <edc:DCRFieldSemantic edc:cname="PWP54K" edc:desc="First 54K" edc:when="(field &amp; 0x1ff) == 0x1c9"/>
              <edc:DCRFieldSemantic edc:cname="PWP55K" edc:desc="First 55K" edc:when="(field &amp; 0x1ff) == 0x1c8"/>
              <edc:DCRFieldSemantic edc:cname="PWP56K" edc:desc="First 56K" edc:when="(field &amp; 0x1ff) == 0x1c7"/>
              <edc:DCRFieldSemantic edc:cname="PWP57K" edc:desc="First 57K" edc:when="(field &amp; 0x1ff) == 0x1c6"/>
              <edc:DCRFieldSemantic edc:cname="PWP58K" edc:desc="First 58K" edc:when="(field &amp; 0x1ff) == 0x1c5"/>
              <edc:DCRFieldSemantic edc:cname="PWP59K" edc:desc="First 59K" edc:when="(field &amp; 0x1ff) == 0x1c4"/>
              <edc:DCRFieldSemantic edc:cname="PWP60K" edc:desc="First 60K" edc:when="(field &amp; 0x1ff) == 0x1c3"/>
              <edc:DCRFieldSemantic edc:cname="PWP61K" edc:desc="First 61K" edc:when="(field &amp; 0x1ff) == 0x1c2"/>
              <edc:DCRFieldSemantic edc:cname="PWP62K" edc:desc="First 62K" edc:when="(field &amp; 0x1ff) == 0x1c1"/>
              <edc:DCRFieldSemantic edc:cname="PWP63K" edc:desc="First 63K" edc:when="(field &amp; 0x1ff) == 0x1c0"/>
              <edc:DCRFieldSemantic edc:cname="PWP64K" edc:desc="First 64K" edc:when="(field &amp; 0x1ff) == 0x1bf"/>
              <edc:DCRFieldSemantic edc:cname="PWP65K" edc:desc="First 65K" edc:when="(field &amp; 0x1ff) == 0x1be"/>
              <edc:DCRFieldSemantic edc:cname="PWP66K" edc:desc="First 66K" edc:when="(field &amp; 0x1ff) == 0x1bd"/>
              <edc:DCRFieldSemantic edc:cname="PWP67K" edc:desc="First 67K" edc:when="(field &amp; 0x1ff) == 0x1bc"/>
              <edc:DCRFieldSemantic edc:cname="PWP68K" edc:desc="First 68K" edc:when="(field &amp; 0x1ff) == 0x1bb"/>
              <edc:DCRFieldSemantic edc:cname="PWP69K" edc:desc="First 69K" edc:when="(field &amp; 0x1ff) == 0x1ba"/>
              <edc:DCRFieldSemantic edc:cname="PWP70K" edc:desc="First 70K" edc:when="(field &amp; 0x1ff) == 0x1b9"/>
              <edc:DCRFieldSemantic edc:cname="PWP71K" edc:desc="First 71K" edc:when="(field &amp; 0x1ff) == 0x1b8"/>
              <edc:DCRFieldSemantic edc:cname="PWP72K" edc:desc="First 72K" edc:when="(field &amp; 0x1ff) == 0x1b7"/>
              <edc:DCRFieldSemantic edc:cname="PWP73K" edc:desc="First 73K" edc:when="(field &amp; 0x1ff) == 0x1b6"/>
              <edc:DCRFieldSemantic edc:cname="PWP74K" edc:desc="First 74K" edc:when="(field &amp; 0x1ff) == 0x1b5"/>
              <edc:DCRFieldSemantic edc:cname="PWP75K" edc:desc="First 75K" edc:when="(field &amp; 0x1ff) == 0x1b4"/>
              <edc:DCRFieldSemantic edc:cname="PWP76K" edc:desc="First 76K" edc:when="(field &amp; 0x1ff) == 0x1b3"/>
              <edc:DCRFieldSemantic edc:cname="PWP77K" edc:desc="First 77K" edc:when="(field &amp; 0x1ff) == 0x1b2"/>
              <edc:DCRFieldSemantic edc:cname="PWP78K" edc:desc="First 78K" edc:when="(field &amp; 0x1ff) == 0x1b1"/>
              <edc:DCRFieldSemantic edc:cname="PWP79K" edc:desc="First 79K" edc:when="(field &amp; 0x1ff) == 0x1b0"/>
              <edc:DCRFieldSemantic edc:cname="PWP80K" edc:desc="First 80K" edc:when="(field &amp; 0x1ff) == 0x1af"/>
              <edc:DCRFieldSemantic edc:cname="PWP81K" edc:desc="First 81K" edc:when="(field &amp; 0x1ff) == 0x1ae"/>
              <edc:DCRFieldSemantic edc:cname="PWP82K" edc:desc="First 82K" edc:when="(field &amp; 0x1ff) == 0x1ad"/>
              <edc:DCRFieldSemantic edc:cname="PWP83K" edc:desc="First 83K" edc:when="(field &amp; 0x1ff) == 0x1ac"/>
              <edc:DCRFieldSemantic edc:cname="PWP84K" edc:desc="First 84K" edc:when="(field &amp; 0x1ff) == 0x1ab"/>
              <edc:DCRFieldSemantic edc:cname="PWP85K" edc:desc="First 85K" edc:when="(field &amp; 0x1ff) == 0x1aa"/>
              <edc:DCRFieldSemantic edc:cname="PWP86K" edc:desc="First 86K" edc:when="(field &amp; 0x1ff) == 0x1a9"/>
              <edc:DCRFieldSemantic edc:cname="PWP87K" edc:desc="First 87K" edc:when="(field &amp; 0x1ff) == 0x1a8"/>
              <edc:DCRFieldSemantic edc:cname="PWP88K" edc:desc="First 88K" edc:when="(field &amp; 0x1ff) == 0x1a7"/>
              <edc:DCRFieldSemantic edc:cname="PWP89K" edc:desc="First 89K" edc:when="(field &amp; 0x1ff) == 0x1a6"/>
              <edc:DCRFieldSemantic edc:cname="PWP90K" edc:desc="First 90K" edc:when="(field &amp; 0x1ff) == 0x1a5"/>
              <edc:DCRFieldSemantic edc:cname="PWP91K" edc:desc="First 91K" edc:when="(field &amp; 0x1ff) == 0x1a4"/>
              <edc:DCRFieldSemantic edc:cname="PWP92K" edc:desc="First 92K" edc:when="(field &amp; 0x1ff) == 0x1a3"/>
              <edc:DCRFieldSemantic edc:cname="PWP93K" edc:desc="First 93K" edc:when="(field &amp; 0x1ff) == 0x1a2"/>
              <edc:DCRFieldSemantic edc:cname="PWP94K" edc:desc="First 94K" edc:when="(field &amp; 0x1ff) == 0x1a1"/>
              <edc:DCRFieldSemantic edc:cname="PWP95K" edc:desc="First 95K" edc:when="(field &amp; 0x1ff) == 0x1a0"/>
              <edc:DCRFieldSemantic edc:cname="PWP96K" edc:desc="First 96K" edc:when="(field &amp; 0x1ff) == 0x19f"/>
              <edc:DCRFieldSemantic edc:cname="PWP97K" edc:desc="First 97K" edc:when="(field &amp; 0x1ff) == 0x19e"/>
              <edc:DCRFieldSemantic edc:cname="PWP98K" edc:desc="First 98K" edc:when="(field &amp; 0x1ff) == 0x19d"/>
              <edc:DCRFieldSemantic edc:cname="PWP99K" edc:desc="First 99K" edc:when="(field &amp; 0x1ff) == 0x19c"/>
              <edc:DCRFieldSemantic edc:cname="PWP100K" edc:desc="First 100K" edc:when="(field &amp; 0x1ff) == 0x19b"/>
              <edc:DCRFieldSemantic edc:cname="PWP101K" edc:desc="First 101K" edc:when="(field &amp; 0x1ff) == 0x19a"/>
              <edc:DCRFieldSemantic edc:cname="PWP102K" edc:desc="First 102K" edc:when="(field &amp; 0x1ff) == 0x199"/>
              <edc:DCRFieldSemantic edc:cname="PWP103K" edc:desc="First 103K" edc:when="(field &amp; 0x1ff) == 0x198"/>
              <edc:DCRFieldSemantic edc:cname="PWP104K" edc:desc="First 104K" edc:when="(field &amp; 0x1ff) == 0x197"/>
              <edc:DCRFieldSemantic edc:cname="PWP105K" edc:desc="First 105K" edc:when="(field &amp; 0x1ff) == 0x196"/>
              <edc:DCRFieldSemantic edc:cname="PWP106K" edc:desc="First 106K" edc:when="(field &amp; 0x1ff) == 0x195"/>
              <edc:DCRFieldSemantic edc:cname="PWP107K" edc:desc="First 107K" edc:when="(field &amp; 0x1ff) == 0x194"/>
              <edc:DCRFieldSemantic edc:cname="PWP108K" edc:desc="First 108K" edc:when="(field &amp; 0x1ff) == 0x193"/>
              <edc:DCRFieldSemantic edc:cname="PWP109K" edc:desc="First 109K" edc:when="(field &amp; 0x1ff) == 0x192"/>
              <edc:DCRFieldSemantic edc:cname="PWP110K" edc:desc="First 110K" edc:when="(field &amp; 0x1ff) == 0x191"/>
              <edc:DCRFieldSemantic edc:cname="PWP111K" edc:desc="First 111K" edc:when="(field &amp; 0x1ff) == 0x190"/>
              <edc:DCRFieldSemantic edc:cname="PWP112K" edc:desc="First 112K" edc:when="(field &amp; 0x1ff) == 0x18f"/>
              <edc:DCRFieldSemantic edc:cname="PWP113K" edc:desc="First 113K" edc:when="(field &amp; 0x1ff) == 0x18e"/>
              <edc:DCRFieldSemantic edc:cname="PWP114K" edc:desc="First 114K" edc:when="(field &amp; 0x1ff) == 0x18d"/>
              <edc:DCRFieldSemantic edc:cname="PWP115K" edc:desc="First 115K" edc:when="(field &amp; 0x1ff) == 0x18c"/>
              <edc:DCRFieldSemantic edc:cname="PWP116K" edc:desc="First 116K" edc:when="(field &amp; 0x1ff) == 0x18b"/>
              <edc:DCRFieldSemantic edc:cname="PWP117K" edc:desc="First 117K" edc:when="(field &amp; 0x1ff) == 0x18a"/>
              <edc:DCRFieldSemantic edc:cname="PWP118K" edc:desc="First 118K" edc:when="(field &amp; 0x1ff) == 0x189"/>
              <edc:DCRFieldSemantic edc:cname="PWP119K" edc:desc="First 119K" edc:when="(field &amp; 0x1ff) == 0x188"/>
              <edc:DCRFieldSemantic edc:cname="PWP120K" edc:desc="First 120K" edc:when="(field &amp; 0x1ff) == 0x187"/>
              <edc:DCRFieldSemantic edc:cname="PWP121K" edc:desc="First 121K" edc:when="(field &amp; 0x1ff) == 0x186"/>
              <edc:DCRFieldSemantic edc:cname="PWP122K" edc:desc="First 122K" edc:when="(field &amp; 0x1ff) == 0x185"/>
              <edc:DCRFieldSemantic edc:cname="PWP123K" edc:desc="First 123K" edc:when="(field &amp; 0x1ff) == 0x184"/>
              <edc:DCRFieldSemantic edc:cname="PWP124K" edc:desc="First 124K" edc:when="(field &amp; 0x1ff) == 0x183"/>
              <edc:DCRFieldSemantic edc:cname="PWP125K" edc:desc="First 125K" edc:when="(field &amp; 0x1ff) == 0x182"/>
              <edc:DCRFieldSemantic edc:cname="PWP126K" edc:desc="First 126K" edc:when="(field &amp; 0x1ff) == 0x181"/>
              <edc:DCRFieldSemantic edc:cname="PWP127K" edc:desc="First 127K" edc:when="(field &amp; 0x1ff) == 0x180"/>
              <edc:DCRFieldSemantic edc:cname="PWP128K" edc:desc="First 128K" edc:when="(field &amp; 0x1ff) == 0x17f"/>
              <edc:DCRFieldSemantic edc:cname="PWP129K" edc:desc="First 129K" edc:when="(field &amp; 0x1ff) == 0x17e"/>
              <edc:DCRFieldSemantic edc:cname="PWP130K" edc:desc="First 130K" edc:when="(field &amp; 0x1ff) == 0x17d"/>
              <edc:DCRFieldSemantic edc:cname="PWP131K" edc:desc="First 131K" edc:when="(field &amp; 0x1ff) == 0x17c"/>
              <edc:DCRFieldSemantic edc:cname="PWP132K" edc:desc="First 132K" edc:when="(field &amp; 0x1ff) == 0x17b"/>
              <edc:DCRFieldSemantic edc:cname="PWP133K" edc:desc="First 133K" edc:when="(field &amp; 0x1ff) == 0x17a"/>
              <edc:DCRFieldSemantic edc:cname="PWP134K" edc:desc="First 134K" edc:when="(field &amp; 0x1ff) == 0x179"/>
              <edc:DCRFieldSemantic edc:cname="PWP135K" edc:desc="First 135K" edc:when="(field &amp; 0x1ff) == 0x178"/>
              <edc:DCRFieldSemantic edc:cname="PWP136K" edc:desc="First 136K" edc:when="(field &amp; 0x1ff) == 0x177"/>
              <edc:DCRFieldSemantic edc:cname="PWP137K" edc:desc="First 137K" edc:when="(field &amp; 0x1ff) == 0x176"/>
              <edc:DCRFieldSemantic edc:cname="PWP138K" edc:desc="First 138K" edc:when="(field &amp; 0x1ff) == 0x175"/>
              <edc:DCRFieldSemantic edc:cname="PWP139K" edc:desc="First 139K" edc:when="(field &amp; 0x1ff) == 0x174"/>
              <edc:DCRFieldSemantic edc:cname="PWP140K" edc:desc="First 140K" edc:when="(field &amp; 0x1ff) == 0x173"/>
              <edc:DCRFieldSemantic edc:cname="PWP141K" edc:desc="First 141K" edc:when="(field &amp; 0x1ff) == 0x172"/>
              <edc:DCRFieldSemantic edc:cname="PWP142K" edc:desc="First 142K" edc:when="(field &amp; 0x1ff) == 0x171"/>
              <edc:DCRFieldSemantic edc:cname="PWP143K" edc:desc="First 143K" edc:when="(field &amp; 0x1ff) == 0x170"/>
              <edc:DCRFieldSemantic edc:cname="PWP144K" edc:desc="First 144K" edc:when="(field &amp; 0x1ff) == 0x16f"/>
              <edc:DCRFieldSemantic edc:cname="PWP145K" edc:desc="First 145K" edc:when="(field &amp; 0x1ff) == 0x16e"/>
              <edc:DCRFieldSemantic edc:cname="PWP146K" edc:desc="First 146K" edc:when="(field &amp; 0x1ff) == 0x16d"/>
              <edc:DCRFieldSemantic edc:cname="PWP147K" edc:desc="First 147K" edc:when="(field &amp; 0x1ff) == 0x16c"/>
              <edc:DCRFieldSemantic edc:cname="PWP148K" edc:desc="First 148K" edc:when="(field &amp; 0x1ff) == 0x16b"/>
              <edc:DCRFieldSemantic edc:cname="PWP149K" edc:desc="First 149K" edc:when="(field &amp; 0x1ff) == 0x16a"/>
              <edc:DCRFieldSemantic edc:cname="PWP150K" edc:desc="First 150K" edc:when="(field &amp; 0x1ff) == 0x169"/>
              <edc:DCRFieldSemantic edc:cname="PWP151K" edc:desc="First 151K" edc:when="(field &amp; 0x1ff) == 0x168"/>
              <edc:DCRFieldSemantic edc:cname="PWP152K" edc:desc="First 152K" edc:when="(field &amp; 0x1ff) == 0x167"/>
              <edc:DCRFieldSemantic edc:cname="PWP153K" edc:desc="First 153K" edc:when="(field &amp; 0x1ff) == 0x166"/>
              <edc:DCRFieldSemantic edc:cname="PWP154K" edc:desc="First 154K" edc:when="(field &amp; 0x1ff) == 0x165"/>
              <edc:DCRFieldSemantic edc:cname="PWP155K" edc:desc="First 155K" edc:when="(field &amp; 0x1ff) == 0x164"/>
              <edc:DCRFieldSemantic edc:cname="PWP156K" edc:desc="First 156K" edc:when="(field &amp; 0x1ff) == 0x163"/>
              <edc:DCRFieldSemantic edc:cname="PWP157K" edc:desc="First 157K" edc:when="(field &amp; 0x1ff) == 0x162"/>
              <edc:DCRFieldSemantic edc:cname="PWP158K" edc:desc="First 158K" edc:when="(field &amp; 0x1ff) == 0x161"/>
              <edc:DCRFieldSemantic edc:cname="PWP159K" edc:desc="First 159K" edc:when="(field &amp; 0x1ff) == 0x160"/>
              <edc:DCRFieldSemantic edc:cname="PWP160K" edc:desc="First 160K" edc:when="(field &amp; 0x1ff) == 0x15f"/>
              <edc:DCRFieldSemantic edc:cname="PWP161K" edc:desc="First 161K" edc:when="(field &amp; 0x1ff) == 0x15e"/>
              <edc:DCRFieldSemantic edc:cname="PWP162K" edc:desc="First 162K" edc:when="(field &amp; 0x1ff) == 0x15d"/>
              <edc:DCRFieldSemantic edc:cname="PWP163K" edc:desc="First 163K" edc:when="(field &amp; 0x1ff) == 0x15c"/>
              <edc:DCRFieldSemantic edc:cname="PWP164K" edc:desc="First 164K" edc:when="(field &amp; 0x1ff) == 0x15b"/>
              <edc:DCRFieldSemantic edc:cname="PWP165K" edc:desc="First 165K" edc:when="(field &amp; 0x1ff) == 0x15a"/>
              <edc:DCRFieldSemantic edc:cname="PWP166K" edc:desc="First 166K" edc:when="(field &amp; 0x1ff) == 0x159"/>
              <edc:DCRFieldSemantic edc:cname="PWP167K" edc:desc="First 167K" edc:when="(field &amp; 0x1ff) == 0x158"/>
              <edc:DCRFieldSemantic edc:cname="PWP168K" edc:desc="First 168K" edc:when="(field &amp; 0x1ff) == 0x157"/>
              <edc:DCRFieldSemantic edc:cname="PWP169K" edc:desc="First 169K" edc:when="(field &amp; 0x1ff) == 0x156"/>
              <edc:DCRFieldSemantic edc:cname="PWP170K" edc:desc="First 170K" edc:when="(field &amp; 0x1ff) == 0x155"/>
              <edc:DCRFieldSemantic edc:cname="PWP171K" edc:desc="First 171K" edc:when="(field &amp; 0x1ff) == 0x154"/>
              <edc:DCRFieldSemantic edc:cname="PWP172K" edc:desc="First 172K" edc:when="(field &amp; 0x1ff) == 0x153"/>
              <edc:DCRFieldSemantic edc:cname="PWP173K" edc:desc="First 173K" edc:when="(field &amp; 0x1ff) == 0x152"/>
              <edc:DCRFieldSemantic edc:cname="PWP174K" edc:desc="First 174K" edc:when="(field &amp; 0x1ff) == 0x151"/>
              <edc:DCRFieldSemantic edc:cname="PWP175K" edc:desc="First 175K" edc:when="(field &amp; 0x1ff) == 0x150"/>
              <edc:DCRFieldSemantic edc:cname="PWP176K" edc:desc="First 176K" edc:when="(field &amp; 0x1ff) == 0x14f"/>
              <edc:DCRFieldSemantic edc:cname="PWP177K" edc:desc="First 177K" edc:when="(field &amp; 0x1ff) == 0x14e"/>
              <edc:DCRFieldSemantic edc:cname="PWP178K" edc:desc="First 178K" edc:when="(field &amp; 0x1ff) == 0x14d"/>
              <edc:DCRFieldSemantic edc:cname="PWP179K" edc:desc="First 179K" edc:when="(field &amp; 0x1ff) == 0x14c"/>
              <edc:DCRFieldSemantic edc:cname="PWP180K" edc:desc="First 180K" edc:when="(field &amp; 0x1ff) == 0x14b"/>
              <edc:DCRFieldSemantic edc:cname="PWP181K" edc:desc="First 181K" edc:when="(field &amp; 0x1ff) == 0x14a"/>
              <edc:DCRFieldSemantic edc:cname="PWP182K" edc:desc="First 182K" edc:when="(field &amp; 0x1ff) == 0x149"/>
