MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX270F256D.PIC
      <edc:SFRDef edc:_addr="0x1F886070" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="1" edc:access="----------------n-n-------------" edc:cname="CNCONA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNCONA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886080" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="1" edc:access="---------------------nnnn--nnnnn" edc:cname="CNENA" edc:desc="" edc:grp="PORTA" edc:impl="0xffc0079f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000-----------xxxx--xxxxx" edc:name="CNENA" edc:nzwidth="0x20" edc:por="0000000000-----------xxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEA0" edc:desc="" edc:mask="0x1" edc:name="CNIEA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA1" edc:desc="" edc:mask="0x1" edc:name="CNIEA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA2" edc:desc="" edc:mask="0x1" edc:name="CNIEA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA3" edc:desc="" edc:mask="0x1" edc:name="CNIEA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA4" edc:desc="" edc:mask="0x1" edc:name="CNIEA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEA7" edc:desc="" edc:mask="0x1" edc:name="CNIEA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA8" edc:desc="" edc:mask="0x1" edc:name="CNIEA8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA9" edc:desc="" edc:mask="0x1" edc:name="CNIEA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA10" edc:desc="" edc:mask="0x1" edc:name="CNIEA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886090" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="1" edc:access="---------------------nnnn--nnnnn" edc:cname="CNSTATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff079f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------xxxx--xxxxx" edc:name="CNSTATA" edc:nzwidth="0x20" edc:por="---------------------xxxx--xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATA0" edc:desc="" edc:mask="0x1" edc:name="CNSTATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA1" edc:desc="" edc:mask="0x1" edc:name="CNSTATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA2" edc:desc="" edc:mask="0x1" edc:name="CNSTATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA3" edc:desc="" edc:mask="0x1" edc:name="CNSTATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA4" edc:desc="" edc:mask="0x1" edc:name="CNSTATA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA7" edc:desc="" edc:mask="0x1" edc:name="CNSTATA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA8" edc:desc="" edc:mask="0x1" edc:name="CNSTATA8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA9" edc:desc="" edc:mask="0x1" edc:name="CNSTATA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA10" edc:desc="" edc:mask="0x1" edc:name="CNSTATA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8860A0" edc:offset="96"/>
      <edc:SFRDef edc:_addr="0x1F886100" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn---------nnnn" edc:cname="ANSELB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffe00f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------111---------1111" edc:name="ANSELB" edc:nzwidth="0x20" edc:por="----------------111---------1111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSB0" edc:desc="" edc:mask="0x1" edc:name="ANSB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB1" edc:desc="" edc:mask="0x1" edc:name="ANSB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB2" edc:desc="" edc:mask="0x1" edc:name="ANSB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB3" edc:desc="" edc:mask="0x1" edc:name="ANSB3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSB13" edc:desc="" edc:mask="0x1" edc:name="ANSB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB14" edc:desc="" edc:mask="0x1" edc:name="ANSB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB15" edc:desc="" edc:mask="0x1" edc:name="ANSB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886110" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn-nnnnn-nnnnnn" edc:cname="TRISB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------111-11111-111111" edc:name="TRISB" edc:nzwidth="0x20" edc:por="----------------111-11111-111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB8" edc:desc="" edc:mask="0x1" edc:name="TRISB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB9" edc:desc="" edc:mask="0x1" edc:name="TRISB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB10" edc:desc="" edc:mask="0x1" edc:name="TRISB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB11" edc:desc="" edc:mask="0x1" edc:name="TRISB11" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISB13" edc:desc="" edc:mask="0x1" edc:name="TRISB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB14" edc:desc="" edc:mask="0x1" edc:name="TRISB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB15" edc:desc="" edc:mask="0x1" edc:name="TRISB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886120" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn-nnnnn-nnnnnn" edc:cname="PORTB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxx-xxxxx-xxxxxx" edc:name="PORTB" edc:nzwidth="0x20" edc:por="----------------xxx-xxxxx-xxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB8" edc:desc="" edc:mask="0x1" edc:name="RB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB9" edc:desc="" edc:mask="0x1" edc:name="RB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB10" edc:desc="" edc:mask="0x1" edc:name="RB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB11" edc:desc="" edc:mask="0x1" edc:name="RB11" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RB13" edc:desc="" edc:mask="0x1" edc:name="RB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB14" edc:desc="" edc:mask="0x1" edc:name="RB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB15" edc:desc="" edc:mask="0x1" edc:name="RB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886130" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn-nnnnn-nnnnnn" edc:cname="LATB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxx-xxxxx-xxxxxx" edc:name="LATB" edc:nzwidth="0x20" edc:por="----------------xxx-xxxxx-xxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB8" edc:desc="" edc:mask="0x1" edc:name="LATB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATB9" edc:desc="" edc:mask="0x1" edc:name="LATB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB10" edc:desc="" edc:mask="0x1" edc:name="LATB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB11" edc:desc="" edc:mask="0x1" edc:name="LATB11" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATB13" edc:desc="" edc:mask="0x1" edc:name="LATB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATB14" edc:desc="" edc:mask="0x1" edc:name="LATB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB15" edc:desc="" edc:mask="0x1" edc:name="LATB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886140" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn-nnnnn-nnnnnn" edc:cname="ODCB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-00000-000000" edc:name="ODCB" edc:nzwidth="0x20" edc:por="----------------000-00000-000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCB0" edc:desc="" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB1" edc:desc="" edc:mask="0x1" edc:name="ODCB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB2" edc:desc="" edc:mask="0x1" edc:name="ODCB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB3" edc:desc="" edc:mask="0x1" edc:name="ODCB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB4" edc:desc="" edc:mask="0x1" edc:name="ODCB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB5" edc:desc="" edc:mask="0x1" edc:name="ODCB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCB7" edc:desc="" edc:mask="0x1" edc:name="ODCB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB8" edc:desc="" edc:mask="0x1" edc:name="ODCB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB9" edc:desc="" edc:mask="0x1" edc:name="ODCB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB10" edc:desc="" edc:mask="0x1" edc:name="ODCB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB11" edc:desc="" edc:mask="0x1" edc:name="ODCB11" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCB13" edc:desc="" edc:mask="0x1" edc:name="ODCB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB14" edc:desc="" edc:mask="0x1" edc:name="ODCB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB15" edc:desc="" edc:mask="0x1" edc:name="ODCB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886150" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn-nnnnn-nnnnnn" edc:cname="CNPUB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxx-xxxxx-xxxxxx" edc:name="CNPUB" edc:nzwidth="0x20" edc:por="----------------xxx-xxxxx-xxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUB0" edc:desc="" edc:mask="0x1" edc:name="CNPUB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB1" edc:desc="" edc:mask="0x1" edc:name="CNPUB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB2" edc:desc="" edc:mask="0x1" edc:name="CNPUB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB3" edc:desc="" edc:mask="0x1" edc:name="CNPUB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB4" edc:desc="" edc:mask="0x1" edc:name="CNPUB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB5" edc:desc="" edc:mask="0x1" edc:name="CNPUB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUB7" edc:desc="" edc:mask="0x1" edc:name="CNPUB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB8" edc:desc="" edc:mask="0x1" edc:name="CNPUB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB9" edc:desc="" edc:mask="0x1" edc:name="CNPUB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB10" edc:desc="" edc:mask="0x1" edc:name="CNPUB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB11" edc:desc="" edc:mask="0x1" edc:name="CNPUB11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUB13" edc:desc="" edc:mask="0x1" edc:name="CNPUB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB14" edc:desc="" edc:mask="0x1" edc:name="CNPUB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB15" edc:desc="" edc:mask="0x1" edc:name="CNPUB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886160" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnn-nnnnn-nnnnnn" edc:cname="CNPDB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxx-xxxxx-xxxxxx" edc:name="CNPDB" edc:nzwidth="0x20" edc:por="----------------xxx-xxxxx-xxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDB0" edc:desc="" edc:mask="0x1" edc:name="CNPDB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB1" edc:desc="" edc:mask="0x1" edc:name="CNPDB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB2" edc:desc="" edc:mask="0x1" edc:name="CNPDB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB3" edc:desc="" edc:mask="0x1" edc:name="CNPDB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB4" edc:desc="" edc:mask="0x1" edc:name="CNPDB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB5" edc:desc="" edc:mask="0x1" edc:name="CNPDB5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDB7" edc:desc="" edc:mask="0x1" edc:name="CNPDB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB8" edc:desc="" edc:mask="0x1" edc:name="CNPDB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB9" edc:desc="" edc:mask="0x1" edc:name="CNPDB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB10" edc:desc="" edc:mask="0x1" edc:name="CNPDB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB11" edc:desc="" edc:mask="0x1" edc:name="CNPDB11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDB13" edc:desc="" edc:mask="0x1" edc:name="CNPDB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB14" edc:desc="" edc:mask="0x1" edc:name="CNPDB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB15" edc:desc="" edc:mask="0x1" edc:name="CNPDB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
